Repository: EternalTimes/wslcontainerdesktop
Catalog: src/WslContainerDesktop/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# Workload_Text_Refresh_0e9161
source: Refresh
zh_hans: 刷新

# Workload_Text_Refresh_logs_8095aa
source: Refresh logs
zh_hans: 刷新日志

# Workload_Text_Registry_05c2e3
source: Registry
zh_hans: 镜像仓库

# Workload_Text_Registry_host_743f8e
source: Registry host
zh_hans: 镜像仓库主机

# Workload_Text_Registry_qualifies_a_bare_image_name_dd2377
source: Registry (qualifies a bare image name)
zh_hans: 镜像仓库（为不带主机名的镜像添加前缀）

# Workload_Text_Reload_bdc090
source: Reload
zh_hans: 重新加载

# Workload_Text_Remove_0_9d64ce
source: Remove {0}?
zh_hans: 移除 {0}？

# Workload_Text_Remove_a_0_deployment_01fe9f
source: Remove a {0} deployment
zh_hans: 移除一个 {0} 部署

# Workload_Text_Remove_c3812f
source: Remove
zh_hans: 移除

# Workload_Text_Remove_containers_f0e82a
source: Remove containers
zh_hans: 删除容器

# Workload_Text_Remove_deployment_20b1db
source: Remove deployment
zh_hans: 移除部署

# Workload_Text_Remove_dev_container_89dc8e
source: Remove dev container
zh_hans: 移除开发容器

# Workload_Text_Remove_project_704e73
source: Remove project
zh_hans: 移除项目

# Workload_Text_Remove_the_project_definition_for_0_158ca8
source: Remove the project definition for "{0}"? This also brings it down (stops and removes its containers) and deletes the volumes it created. External volumes are preserved.
zh_hans: 移除“{0}”的项目定义吗？这也会停止并删除其容器，以及它创建的数据卷。外部数据卷将保留。

# Workload_Text_Remove_when_it_exits_rm_695a93
source: Remove when it exits (--rm)
zh_hans: 退出时移除（--rm）

# Workload_Text_Removed_0_7285c3
source: Removed "{0}"
zh_hans: 已移除“{0}”

# Workload_Text_Removing_0_4bf34d
source: Removing "{0}"…
zh_hans: 正在移除“{0}”…

# Workload_Text_Removing_0_8e3a5e
source: Removing {0}…
zh_hans: 正在移除 {0}…

# Workload_Text_Repositories_1e32af
source: Repositories
zh_hans: 仓库

# Workload_Text_Resolved_Compose_settings_and_compatibility_2ae794
source: Resolved Compose settings and compatibility
zh_hans: 解析后的 Compose 设置及兼容性

# Workload_Text_Restart_0_950992
source: Restart: {0}
zh_hans: 重启：{0}

# Workload_Text_Restart_6b983a
source: Restart
zh_hans: 重启

# Workload_Text_Restart_WSL_session_574951
source: Restart WSL session
zh_hans: 重启 WSL 会话

# Workload_Text_Restart_failed_b8864c
source: Restart failed
zh_hans: 重启失败

# Workload_Text_Restart_project_101a59
source: Restart project
zh_hans: 重启项目

# Workload_Text_Restarting_0_aba7d5
source: Restarting "{0}"…
zh_hans: 正在重启“{0}”…

# Workload_Text_Restarting_WSL_session_ab25ce
source: Restarting WSL session…
zh_hans: 正在重启 WSL 会话…

# Workload_Text_Review_Compose_0_1_857679
source: Review Compose {0}: {1}
zh_hans: 检查 Compose {0}：{1}

# Workload_Text_Review_and_apply_4954f1
source: Review and apply
zh_hans: 检查并应用

# Workload_Text_Review_storage_before_saving_4c4ee4
source: Review storage before saving:
zh_hans: 保存前请检查存储：

# Workload_Text_Review_these_unsupported_or_engine_dependent_dfe63d
source: Review these unsupported or engine-dependent settings before importing:
zh_hans: 导入前请查看以下不受支持或取决于引擎的设置：

# Workload_Text_Reviewing_0_no_images_or_services_2159fa
source: Reviewing {0}… no images or services are changed before confirmation.
zh_hans: 正在检查 {0}…确认前不会更改镜像或服务。

# Workload_Text_Rolling_restart_9dc791
source: Rolling restart
zh_hans: 滚动重启

# Workload_Text_Run_00d60e
source: Run
zh_hans: 运行

# Workload_Text_Run_a_container_946d60
source: Run a container
zh_hans: 运行容器

# Workload_Text_Run_in_background_d_6edd7f
source: Run in background (-d)
zh_hans: 在后台运行（-d）

# Workload_Text_Run_now_099139
source: Run now
zh_hans: 立即运行

# Workload_Text_Running_0_1_instances_684b8f
source: Running ({0}/{1} instances)
zh_hans: 运行中（{0}/{1} 个实例）

# Workload_Text_Running_f4ccae
source: Running
zh_hans: 运行中

# Workload_Text_SCHEDULE_5a40b6
source: SCHEDULE
zh_hans: 计划

# Workload_Text_SCOPE_f03506
source: SCOPE
zh_hans: 作用域

# Workload_Text_SERVICES_019c52
source: SERVICES
zh_hans: 服务

# Workload_Text_STATUS_8c2e4a
source: STATUS
zh_hans: 状态

# Workload_Text_STORAGE_CLASS_8b0f67
source: STORAGE CLASS
zh_hans: 存储类

# Workload_Text_Save_1509f5
source: Save
zh_hans: 保存

# Workload_Text_Save_as_profile_69abb4
source: Save as profile
zh_hans: 另存为运行配置

# Workload_Text_Save_as_run_profile_e6193b
source: Save as run profile
zh_hans: 另存为运行配置

# Workload_Text_Save_launch_77d7c3
source: Save & launch
zh_hans: 保存并启动

# Workload_Text_Save_these_replica_counts_for_future_f66fa8
source: Save these replica counts for future applies
zh_hans: 保存这些副本数，供以后应用时使用

# Workload_Text_Saved_b5c120
source: Saved
zh_hans: 已保存

# Workload_Text_Saved_profile_0_4f05ac
source: Saved profile "{0}".
zh_hans: 已保存运行配置“{0}”。

# Workload_Text_Saved_profile_52c48e
source: Saved profile
zh_hans: 已保存的运行配置

# Workload_Text_Scale_0_c8b401
source: Scale {0}
zh_hans: 缩放 {0}

# Workload_Text_Scale_f10298
source: Scale
zh_hans: 缩放

# Workload_Text_Scale_failed_d6a24c
source: Scale failed
zh_hans: 缩放失败

# Workload_Text_Scaled_to_zero_edb205
source: Scaled to zero
zh_hans: 已缩容至零

# Workload_Text_Secret_7e32a7
source: Secret
zh_hans: 机密

# Workload_Text_Secrets_d8707d
source: Secrets
zh_hans: 机密

# Workload_Text_Select_a_network_4257f6
source: Select a network…
zh_hans: 选择网络…

# Workload_Text_Select_a_saved_profile_to_delete_0e9283
source: Select a saved profile to delete.
zh_hans: 请选择要删除的运行配置。

# Workload_Text_Select_a_volume_1e833c
source: Select a volume…
zh_hans: 选择数据卷…

# Workload_Text_Select_at_least_one_service_No_2358e8
source: Select at least one service. No operation was performed.
zh_hans: 请至少选择一个服务。未执行任何操作。

# Workload_Text_Select_at_least_one_service_before_f4ea1a
source: Select at least one service before continuing.
zh_hans: 请至少选择一个服务后再继续。

# Workload_Text_Select_one_or_more_services_15d5fd
source: Select one or more services.
zh_hans: 选择一个或多个服务。

# Workload_Text_Select_or_enter_a_network_name_6b4aae
source: Select or enter a network name.
zh_hans: 请选择或输入网络名称。

# Workload_Text_Select_services_aeef2c
source: Select services
zh_hans: 选择服务

# Workload_Text_Selected_0_1_96ae7f
source: Selected {0}:{1}.
zh_hans: 已选择 {0}:{1}。

# Workload_Text_Service_d67719
source: Service
zh_hans: 服务

# Workload_Text_Service_operation_failed_d4aeef
source: Service operation failed
zh_hans: 服务操作失败

# Workload_Text_Services_604dce
source: Services
zh_hans: 服务

# Workload_Text_Services_to_manage_4e428f
source: Services to manage
zh_hans: 要管理的服务

# Workload_Text_Short_one_line_summary_shown_on_a55f71
source: Short one-line summary shown on the card
zh_hans: 卡片上显示的简短摘要

# Workload_Text_Show_hidden_88ee90
source: Show hidden
zh_hans: 显示已隐藏的内容

# Workload_Text_Sign_in_to_Azure_111dcf
source: Sign in to Azure
zh_hans: 登录 Azure

# Workload_Text_Signed_in_as_0_Choose_a_6391e5
source: Signed in as {0}. Choose a subscription and registry.
zh_hans: 已以 {0} 登录。请选择订阅和镜像仓库。

# Workload_Text_Signed_in_as_0_Loading_subscriptions_0b62b2
source: Signed in as {0}. Loading subscriptions…
zh_hans: 已以 {0} 登录。正在加载订阅…

# Workload_Text_Signed_in_as_0_but_no_1ab02d
source: Signed in as {0}, but no subscriptions were found.
zh_hans: 已以 {0} 登录，但未找到订阅。

# Workload_Text_Signed_in_but_could_not_read_303e96
source: Signed in, but could not read the account. Try again.
zh_hans: 已登录，但无法读取账户。请重试。

# Workload_Text_Signed_in_to_0_as_1_43bf73
source: ✓ Signed in to {0} as {1}.
zh_hans: ✓ 已以 {1} 登录 {0}。

# Workload_Text_Signed_in_to_0_dc397c
source: ✓ Signed in to {0}.
zh_hans: ✓ 已登录 {0}。

# Workload_Text_Single_container_faa72c
source: Single container
zh_hans: 单个容器

# Workload_Text_Skip_for_now_b58eb5
source: Skip for now
zh_hans: 暂时跳过

# Workload_Text_Some_services_couldn_t_mount_their_679633
source: Some services couldn't mount their configs/secrets because wslc hit its session bind-mount limit (15 distinct host paths). Restart the WSL session to release the slots, then bring the project up again. Restarting stops all running containers. Restart now?
zh_hans: 部分服务无法挂载配置或机密，因为 wslc 已达到会话绑定挂载限制（15 个不同的主机路径）。重启 WSL 会话可释放挂载位置，然后重新启动项目。重启会停止所有运行中的容器。现在重启吗？

# Workload_Text_Specific_version_c36f2c
source: Specific version
zh_hans: 指定版本

# Workload_Text_Start_e4bb9f
source: Start
zh_hans: 启动

# Workload_Text_Starting_0_downloading_the_image_if_1a0af8
source: Starting {0}… downloading the image if needed, this can take a moment.
zh_hans: 正在启动 {0}…如需下载镜像，可能需要一些时间。

# Workload_Text_Starting_aeed4d
source: Starting
zh_hans: 正在启动

# Workload_Text_Starting_cluster_1c3f3a
source: Starting cluster…
zh_hans: 正在启动集群…

# Workload_Text_Status_unavailable_7eb5af
source: Status unavailable
zh_hans: 状态不可用

# Workload_Text_Stop_and_remove_all_containers_for_e1a7c1
source: Stop and remove all containers for "{0}"? The project definition is kept.
zh_hans: 停止并删除“{0}”的所有容器吗？项目定义将保留。

# Workload_Text_Stop_and_remove_only_the_selected_e2c247
source: Stop and remove only the selected services' containers. Shared networks, volumes, and the project definition are preserved. Other services are not removed and may lose access to these services.
zh_hans: 仅停止并删除选中服务的容器。共享网络、数据卷和项目定义将保留。其他服务不会删除，但可能无法访问这些服务。

# Workload_Text_Stop_and_start_existing_containers_without_43f5a0
source: Stop and start existing containers without applying configuration or rebuilding
zh_hans: 停止并启动现有容器，不应用配置或重新构建

# Workload_Text_Stop_and_start_only_existing_selected_3b48b2
source: Stop and start only existing selected containers, plus dependents with restart: true. Does not create or recreate containers, build images, or apply configuration changes.
zh_hans: 仅停止并启动选中的现有容器，以及设置了 restart: true 的依赖服务。不会创建或重新创建容器、构建镜像或应用配置变更。

# Workload_Text_Stop_and_start_the_existing_containers_536030
source: Stop and start the existing containers for "{0}" in dependency order? Restart does not create or recreate containers, build images, or apply configuration changes. Use Up (Apply) to apply changes.
zh_hans: 按依赖顺序停止并启动“{0}”的现有容器吗？ 重启不会创建或重新创建容器、构建镜像或应用配置变更。请使用“启动（应用）”应用变更。

# Workload_Text_Stop_cae7d5
source: Stop
zh_hans: 停止

# Workload_Text_Stop_failed_68349a
source: Stop failed
zh_hans: 停止失败

# Workload_Text_Stop_only_the_selected_services_Containers_f80159
source: Stop only the selected services. Containers, shared networks, and volumes are preserved. Other services are not stopped and may lose access to these services.
zh_hans: 仅停止选中的服务。容器、共享网络和数据卷将保留。其他服务不会停止，但可能无法访问这些服务。

# Workload_Text_Stop_remove_and_forget_0_6723d8
source: Stop, remove, and forget "{0}"?
zh_hans: 停止、删除并移除“{0}”的记录吗？

# Workload_Text_Stop_timeout_must_be_blank_1_0c4dc3
source: Stop timeout must be blank, -1, or a nonnegative whole number of seconds.
zh_hans: 停止超时必须为空、-1 或非负整数秒数。

# Workload_Text_Stop_timeout_seconds_706777
source: Stop timeout (seconds)
zh_hans: 停止超时（秒）

# Workload_Text_Stop_using_the_distribution_configured_for_98e754
source: Stop using the distribution configured for Kubernetes and use WSL's default distribution instead.
zh_hans: 停用为 Kubernetes 配置的发行版，改用 WSL 默认发行版。

# Workload_Text_Stopped_0_9ae09a
source: Stopped "{0}"
zh_hans: 已停止“{0}”

# Workload_Text_Stopped_1a4f63
source: Stopped
zh_hans: 已停止

# Workload_Text_Stopping_0_a7625f
source: Stopping "{0}"…
zh_hans: 正在停止“{0}”…

# Workload_Text_Stopping_cluster_ba0634
source: Stopping cluster…
zh_hans: 正在停止集群…

# Workload_Text_Stops_and_removes_the_0_container_f4fce7
source: Stops and removes the "{0}" container.
zh_hans: 停止并删除“{0}”容器。

# Workload_Text_Stops_and_removes_the_0_stack_9276d2
source: Stops and removes the "{0}" stack's containers and its network.
zh_hans: 停止并删除“{0}”堆栈的容器及其网络。

# Workload_Text_Subnet_optional_CIDR_786318
source: Subnet (optional, CIDR)
zh_hans: 子网（可选，CIDR）

# Workload_Text_Subscription_4999c6
source: Subscription
zh_hans: 订阅

# Workload_Text_Summary_8e76a9
source: Summary
zh_hans: 摘要

# Workload_Text_Suspend_or_resume_715f3e
source: Suspend or resume
zh_hans: 暂停或恢复

# Workload_Text_Suspend_resume_7bd076
source: Suspend / resume
zh_hans: 暂停 / 恢复

# Workload_Text_TCP_port_host_side_connect_51de6b
source: TCP port (host-side connect)
zh_hans: TCP 端口（从主机连接）

# Workload_Text_TYPE_a90bab
source: TYPE
zh_hans: 类型

# Workload_Text_Tags_133127
source: Tags
zh_hans: 标签

# Workload_Text_Target_978354
source: Target
zh_hans: 目标

# Workload_Text_Target_port_cab875
source: Target port
zh_hans: 目标端口

# Workload_Text_Target_type_8a1c2f
source: Target type
zh_hans: 目标类型

# Workload_Text_Templates_56b564
source: Templates
zh_hans: 模板

# Workload_Text_The_Azure_CLI_az_is_not_6ae5e4
source: The Azure CLI (az) is not installed or not on your PATH. Install it, then reopen this dialog. You can still add a registry manually with the "Add registry" button.
zh_hans: Azure CLI（az）尚未安装或不在 PATH 中。请安装后重新打开此对话框。也可以通过“添加镜像仓库”按钮手动添加镜像仓库。

# Workload_Text_The_image_is_built_and_kept_ee8e62
source: The image is built and kept on this PC. Nothing is uploaded.
zh_hans: 镜像将在此计算机上构建并保留，不会上传。

# Workload_Text_The_installer_downloaded_from_https_get_5dbca2
source: The installer downloaded from https://get.k3s.io no longer matches the script you previously approved on this machine. Previously approved SHA-256: {0} Newly downloaded SHA-256: {1} This is normal when the k3s project updates its installer, but only continue if you trust the source. Approve the new script and continue?
zh_hans: 从 https://get.k3s.io 下载的安装脚本与此前在此计算机上批准的脚本不一致。 此前批准的 SHA-256： {0} 新下载的 SHA-256： {1} k3s 项目更新安装脚本时会出现这种情况；请仅在信任来源时继续。批准新脚本并继续吗？

# Workload_Text_The_launch_could_not_complete_Check_6eee79
source: The launch could not complete. Check the container engine and retry. {0}
zh_hans: 启动未完成。请检查容器引擎后重试。 {0}

# Workload_Text_The_selected_version_0_is_older_a76984
source: The selected version {0} is older than the installed version {1}. k3s does not support downgrades; pick the same or a newer version.
zh_hans: 所选版本 {0} 早于已安装版本 {1}。k3s 不支持降级；请选择相同或更新的版本。

# Workload_Text_The_upgrade_re_runs_the_k3s_f22876
source: The upgrade re-runs the k3s install script in place. Your cluster data and workloads are preserved; the service restarts briefly.
zh_hans: 升级会重新执行 k3s 安装脚本。集群数据和工作负载将保留，服务会短暂重启。

# Workload_Text_There_are_0_separate_1_deployments_1f4289
source: There are {0} separate {1} deployments. Choose the one to remove; the others are left running.
zh_hans: 有 {0} 个独立的 {1} 部署。请选择要移除的部署，其余部署将继续运行。

# Workload_Text_This_installs_k3s_a_lightweight_single_06d10a
source: This installs k3s (a lightweight single-node Kubernetes) into
zh_hans: 这会将 k3s（轻量级单节点 Kubernetes）安装到

# Workload_Text_This_releases_wslc_s_leaked_bind_ddc612
source: This releases wslc's leaked bind-mount slots (needed when config/secret mounts start failing after ~15 distinct mounts). It also STOPS ALL running containers. Continue?
zh_hans: 这会释放 wslc 泄漏的绑定挂载位置（配置或机密在约 15 个不同路径挂载后开始失败时需要）。也会停止所有运行中的容器。继续吗？

# Workload_Text_This_removes_the_template_from_your_44188d
source: This removes the template from your gallery. Any containers it already launched are not affected — use "Remove deployment" first if you also want to tear those down.
zh_hans: 这会从模板库中移除模板。它已启动的容器不受影响；如果也要删除这些容器，请先使用“移除部署”。

# Workload_Text_This_stops_and_completely_removes_k3s_0dc606
source: This stops and completely removes k3s and all cluster data from your WSL distro. Running workloads will be destroyed. This cannot be undone. Continue?
zh_hans: 这会停止并从 WSL 发行版中彻底移除 k3s 及所有集群数据。运行中的工作负载将被删除。此操作无法撤销。继续吗？

# Workload_Text_Total_c9b3c3
source: Total
zh_hans: 总数

# Workload_Text_Trigger_failed_78bed2
source: Trigger failed
zh_hans: 触发失败

# Workload_Text_Type_baaddf
source: Type
zh_hans: 类型

# Workload_Text_Unable_to_determine_status_c9aef1
source: Unable to determine status.
zh_hans: 无法确定状态。

# Workload_Text_Unavailable_ca1844
source: Unavailable
zh_hans: 不可用

# Workload_Text_Unhide_eb2780
source: Unhide
zh_hans: 取消隐藏

# Workload_Text_Uninstall_Kubernetes_70f934
source: Uninstall Kubernetes
zh_hans: 卸载 Kubernetes

# Workload_Text_Uninstall_failed_ecbcb5
source: Uninstall failed
zh_hans: 卸载失败

# Workload_Text_Uninstall_fe1995
source: Uninstall
zh_hans: 卸载

# Workload_Text_Uninstalling_k3s_and_cleaning_up_187610
source: Uninstalling k3s and cleaning up…
zh_hans: 正在卸载 k3s 并清理…

# Workload_Text_Up_55490a
source: Up
zh_hans: 启动

# Workload_Text_Up_Apply_apply_configuration_keep_unchanged_071bc2
source: Up (Apply): apply configuration; keep unchanged running containers
zh_hans: 启动（应用）：应用配置，保留未更改且运行中的容器

# Workload_Text_Upgrade_7ec026
source: Upgrade
zh_hans: 升级

# Workload_Text_Upgrade_Kubernetes_k3s_18fbae
source: Upgrade Kubernetes (k3s)
zh_hans: 升级 Kubernetes（k3s）

# Workload_Text_Upgrade_complete_b68ef9
source: Upgrade complete.
zh_hans: 升级完成。

# Workload_Text_Upgrade_failed_9b8d54
source: Upgrade failed
zh_hans: 升级失败

# Workload_Text_Upgrade_one_minor_version_at_a_3f0567
source: Upgrade one minor version at a time
zh_hans: 每次只升级一个次版本

# Workload_Text_Upgrade_to_next_minor_8477ce
source: Upgrade to next minor
zh_hans: 升级至下一个次版本

# Workload_Text_Upgrading_from_0_to_1_would_b0814e
source: Upgrading from {0} to {1} would skip intermediate minor versions, which is not supported. Could not resolve the {2} channel to step through. Check your network and try again.
zh_hans: 从 {0} 升级到 {1} 会跳过中间的次版本，这是不受支持的操作。无法解析 {2} 通道以逐步升级。请检查网络后重试。

# Workload_Text_Upgrading_k3s_to_the_latest_stable_473d09
source: Upgrading k3s to the latest stable release…
zh_hans: 正在将 k3s 升级至最新稳定版…

# Workload_Text_Uploads_every_tag_of_0_Your_1b265e
source: Uploads every tag of {0}. Your image on this PC is not changed.
zh_hans: 上传 {0} 的每个标签。此计算机上的镜像不会更改。

# Workload_Text_Uploads_it_as_0_Your_image_7c6d7a
source: Uploads it as {0}. Your image on this PC is not changed.
zh_hans: 以 {0} 上传。此计算机上的镜像不会更改。

# Workload_Text_Use_the_Kube_tab_to_view_2d1a36
source: Use the Kube tab to view and edit the full manifest, or Describe for a detailed status view.
zh_hans: 使用“清单”选项卡查看和编辑完整清单，使用“详细状态”查看具体状态。

# Workload_Text_Use_the_default_distribution_acde81
source: Use the default distribution
zh_hans: 使用默认发行版

# Workload_Text_Username_e3b89e
source: Username
zh_hans: 用户名

# Workload_Text_Username_optional_e946bd
source: Username (optional)
zh_hans: 用户名（可选）

# Workload_Text_VERSION_7b60b8
source: VERSION
zh_hans: 版本

# Workload_Text_Version_4c5726
source: Version:
zh_hans: 版本：

# Workload_Text_View_config_maps_10b7d7
source: View config maps
zh_hans: 查看配置映射

# Workload_Text_View_cronjobs_48b192
source: View cronjobs
zh_hans: 查看定时任务

# Workload_Text_View_deployments_493d62
source: View deployments
zh_hans: 查看部署

# Workload_Text_View_ingresses_7e863c
source: View ingresses
zh_hans: 查看入口

# Workload_Text_View_jobs_700ab4
source: View jobs
zh_hans: 查看任务

# Workload_Text_View_nodes_b3f9e1
source: View nodes
zh_hans: 查看节点

# Workload_Text_View_persistent_volume_claims_d8409f
source: View persistent volume claims
zh_hans: 查看持久卷声明

# Workload_Text_View_pods_ca4b26
source: View pods
zh_hans: 查看 Pod

# Workload_Text_View_port_forwarding_475977
source: View port forwarding
zh_hans: 查看端口转发

# Workload_Text_View_secrets_02923f
source: View secrets
zh_hans: 查看机密

# Workload_Text_View_services_85affc
source: View services
zh_hans: 查看服务

# Workload_Text_Volumes_binds_one_per_line_source_e95df3
source: Volumes / binds (one per line: source:destination)
zh_hans: 数据卷 / 绑定挂载（每行一个：source:destination）

# Workload_Text_Volumes_one_per_line_source_destination_4707bc
source: Volumes (one per line, source:destination)
zh_hans: 数据卷（每行一个 source:destination）

# Workload_Text_WSL_session_restarted_mount_slots_released_c52c57
source: WSL session restarted — mount slots released. Bring your projects up again.
zh_hans: WSL 会话已重启，挂载位置已释放。请重新启动项目。

# Workload_Text_WSL_template_a8eeed
source: WSL template
zh_hans: WSL 模板

# Workload_Text_Warning_0_bebde3
source: Warning: {0}
zh_hans: 警告：{0}

# Workload_Text_Warnings_f11208
source: Warnings:
zh_hans: 警告：

# Workload_Text_What_this_does_03f458
source: What this does
zh_hans: 将执行的操作

# Workload_Text_Which_deployment_44c49c
source: Which deployment?
zh_hans: 选择哪个部署？

# Workload_Text_Will_pull_0_8e5c64
source: Will pull: {0}
zh_hans: 将拉取：{0}

# Workload_Text_Will_pull_1cbdae
source: Will pull: —
zh_hans: 将拉取：—

# Workload_Text_Will_pull_all_tags_in_0_c1c7d0
source: Will pull all tags in: {0}
zh_hans: 将拉取所有标签：{0}

# Workload_Text_Workspace_0_738edb
source: Workspace: {0}
zh_hans: 工作区：{0}

# Workload_Text_Workspace_folder_0_c8349c
source: Workspace folder: {0}
zh_hans: 工作区文件夹：{0}

# Workload_Text_You_don_t_have_any_custom_1b1898
source: You don't have any custom or imported templates yet. Create or import one first, or use a card's Export… to share a built-in template.
zh_hans: 尚无自定义或导入的模板。请先创建或导入模板，也可使用卡片的“导出…”分享内置模板。

# Workload_Text_You_ll_be_added_using_your_49ca44
source: You'll be added using your Azure sign-in — a short-lived token is fetched automatically, so no registry username or password is needed.
zh_hans: 将使用 Azure 登录状态添加镜像仓库，自动获取短期令牌，无需镜像仓库用户名或密码。

# Workload_Text_You_re_not_signed_in_to_3581f2
source: You're not signed in to Azure.
zh_hans: 尚未登录 Azure。

# Workload_Text_You_re_not_signed_in_to_8756be
source: You're not signed in to {0}. Pushing needs an account there: sign in on the Registries page, then push again.
zh_hans: 尚未登录 {0}。推送需要该镜像仓库的账户，请在“镜像仓库”页面登录后重新推送。

# Workload_Text_You_re_on_0_Upgrading_straight_9b7945
source: You're on {0}. Upgrading straight to {1} would skip intermediate minor versions (v{2}.{3} … v{4}.{5}), which the Kubernetes version-skew policy does not allow. Upgrade to {6} first instead? You can repeat the upgrade afterwards to continue toward {7}.
zh_hans: 当前版本为 {0}。直接升级到 {1} 会跳过中间的次版本（v{2}.{3} … v{4}.{5}），Kubernetes 版本兼容策略不允许这样做。 先升级到 {6} 吗？之后可以继续升级至 {7}。

# Workload_Text_active_968796
source: active
zh_hans: 活动

# Workload_Text_and_0_more_7bbbe9
source: • …and {0} more.
zh_hans: • …还有 {0} 项。

# Workload_Text_and_0_more_a38682
source: • …and {0} more.
zh_hans: • …还有 {0} 项。

# Workload_Text_and_its_data_volumes_fee57a
source: and its data volumes
zh_hans: 及其数据卷

# Workload_Text_command_0_d5f841
source: command: {0}
zh_hans: 命令：{0}

# Workload_Text_downloads_0_1_2_6a06ac
source: downloads {0} {1} ({2})
zh_hans: 下载 {0} 个{1}（{2}）

# Workload_Text_e_g_172_28_0_0_c3ba25
source: e.g. 172.28.0.0/16
zh_hans: 例如：172.28.0.0/16

# Workload_Text_e_g_172_28_0_1_af839f
source: e.g. 172.28.0.1
zh_hans: 例如：172.28.0.1

# Workload_Text_e_g_172_28_5_0_dba741
source: e.g. 172.28.5.0/24
zh_hans: 例如：172.28.5.0/24

# Workload_Text_e_g_3_8c2fb7
source: e.g. 3
zh_hans: 例如：3

# Workload_Text_e_g_8080_452a03
source: e.g. 8080
zh_hans: 例如：8080

# Workload_Text_e_g_80_d3a954
source: e.g. 80
zh_hans: 例如：80

# Workload_Text_e_g_Company_ACR_68810c
source: e.g. Company ACR
zh_hans: 例如：公司 ACR

# Workload_Text_e_g_Databases_da64e7
source: e.g. Databases
zh_hans: 例如：数据库

# Workload_Text_e_g_My_PostgreSQL_bb660a
source: e.g. My PostgreSQL
zh_hans: 例如：我的 PostgreSQL

# Workload_Text_e_g_app_net_8fe647
source: e.g. app-net
zh_hans: 例如：app-net

# Workload_Text_e_g_curl_fsS_http_localhost_bd1c87
source: e.g. curl -fsS http://localhost:8080/health
zh_hans: 例如：curl -fsS http://localhost:8080/health

# Workload_Text_e_g_default_credentials_shown_after_ecb42d
source: e.g. default credentials, shown after launch
zh_hans: 例如：启动后显示的默认凭据

# Workload_Text_e_g_my_postgres_8c1cd3
source: e.g. my-postgres
zh_hans: 例如：my-postgres

# Workload_Text_e_g_my_stack_defd5e
source: e.g. my-stack
zh_hans: 例如：my-stack

# Workload_Text_e_g_myregistry_azurecr_io_ghcr_6930ef
source: e.g. myregistry.azurecr.io, ghcr.io
zh_hans: 例如：myregistry.azurecr.io、ghcr.io

# Workload_Text_e_g_postgres_16_0a25a7
source: e.g. postgres:16
zh_hans: 例如：postgres:16

# Workload_Text_e_g_team_myapp_1_0_201728
source: e.g. team/myapp:1.0
zh_hans: 例如：team/myapp:1.0

# Workload_Text_e_g_ubuntu_latest_d7980e
source: e.g. ubuntu:latest
zh_hans: 例如：ubuntu:latest

# Workload_Text_e_g_ubuntu_latest_or_myapp_78466f
source: e.g. ubuntu:latest or myapp:1.0
zh_hans: 例如：ubuntu:latest 或 myapp:1.0

# Workload_Text_e_g_v1_36_2_k3s1_f05394
source: e.g. v1.36.2+k3s1
zh_hans: 例如：v1.36.2+k3s1

# Workload_Text_entrypoint_0_a89ece
source: entrypoint: {0}
zh_hans: 入口点：{0}
